proyecto_Beck_Pablo/app/Controllers/CarritoController.php

SELECT *
FROM `productos`
WHERE `id_producto` = '59'
 LIMIT 1
INSERT INTO `ventas` (`id_cliente`, `fecha_venta`) VALUES ('19', '2024-09-24')
---
    public function guardarVenta() {
    $cart = Services::cart();
    $productos = new Productos();
    $ventas = new Ventas();
    $detalle = new DetalleVenta();

    $cart1 = $cart->contents();

    // Verificar stock
    foreach ($cart1 as $item) {
        $producto = $productos->where('id_producto', $item['id'])->first();
        if ($producto['stock'] < $item['qty']) {
            return redirect()->route('carrito')->with('mensaje', 'No hay stock para el producto ' . $producto['nom_producto']);
        }
    }

    // Iniciar transacción
    $db = \Config\Database::connect();
    $db->transStart();

    // Insertar la venta principal
    $data = array('id_cliente' => session('id'), 'fecha_venta' => date('Y-m-d'));
    $ventas->insert($data);

SELECT *
FROM `productos`
WHERE `id_producto` = '59'
 LIMIT 1
UPDATE `productos` SET `stock` = 12
WHERE `productos`.`id_producto` IN ('59')
---
        // Depuración: mostrar datos de detalleVenta
        log_message('debug', 'Detalle Venta Data: ' . print_r($detalleVenta, true));

        $producto = $productos->where('id_producto', $item['id'])->first();
        $data = ['stock' => intval($producto['stock']) - $item['qty']];

        // Actualizar stock del producto
        if (!$productos->update($item['id'], $data)) {

INSERT INTO `detalle_venta` (`id_venta`, `id_producto`, `detalle_cantidad`, `detalle_precio`) VALUES (17, '59', 1, 100000)
---
        }

        // Insertar detalle de la venta
        if (!$detalle->insert($detalleVenta)) {

SELECT `productos`.`nom_producto`, `productos`.`marca`, `productos`.`img_producto`, `detalle_venta`.`detalle_cantidad`, `detalle_venta`.`detalle_precio`, `ventas`.`fecha_venta`
FROM `usuarios`
JOIN `ventas` ON `ventas`.`id_cliente` = `usuarios`.`id`
JOIN `detalle_venta` ON `detalle_venta`.`id_venta` = `ventas`.`id_venta`
JOIN `productos` ON `productos`.`id_producto` = `detalle_venta`.`id_producto`
WHERE `usuarios`.`id` = '19'
---
    public function productosCompradosPorUsuario($userId) {
        $usuarios = new Usuarios();
        $detalle = new DetalleVenta();
        $productos = new Productos();
        $ventas = new Ventas();

        $consulta = $usuarios
            ->select('productos.nom_producto, productos.marca, productos.img_producto, detalle_venta.detalle_cantidad, detalle_venta.detalle_precio, ventas.fecha_venta')
            ->join('ventas', 'ventas.id_cliente = usuarios.id')
            ->join('detalle_venta', 'detalle_venta.id_venta = ventas.id_venta')
            ->join('productos', 'productos.id_producto = detalle_venta.id_producto')
            ->where('usuarios.id', $userId)->findAll();