proyecto_Beck_Pablo/app/Controllers/Home.php

SELECT *
FROM `productos`
---
    public function index(): string {
        $productos = new Productos();
        $data = [
            'titulo' => 'Inicio',
            'productos' => $productos->findAll()

SELECT *
FROM `productos`
---
    public function clienteRegistrado(): string{
        $productos = new Productos();
        $data = [
            'titulo' => 'Inicio',
            'productos' => $productos->findAll()