proyecto_Beck_Pablo/app/Controllers/ProductosController.php

SELECT *
FROM `productos`
---
    public function celularesVista(): string{
        $productos = new Productos();
        $data = [
            "titulo" => "Celulares",
            'productos' => $productos->findAll()