proyecto_Beck_Pablo/app/Controllers/ValidarFormularios.php

    public function validarIniciarSesion() {
        $validation = \Config\Services::validation();
        $request = \Config\Services::request();
        $validation->setRules([
            'correo' => 'required|valid_email|is_unique[users.correo,id,{id}]',
            'password' => 'required|min_length[8]|max_length[16]'
        ], [
            'correo' => [
                'required' => 'El campo de correo es obligatorio.',
                'valid_email' => 'El correo ingresado es inválido.',
                'is_unique' => 'Ya hay un usuario con este mismo correo.'
            ],
            'password' => [
                'required' => 'El campo de contraseña es obligatorio.',
                'min_length' => 'La contraseña debe tener al menos 8 caracteres.',
                'max_length' => 'La contraseña debe tener como máximo 16 caracteres.'
            ]
        ]);

        $mail = $request->getPost('correo');
        $pass = $request->getPost('password');

        // Buscar el usuario en la base de datos
        $usuarios = new Usuarios();
        $user = $usuarios->where('correo', $mail)->first();
---
SELECT *
FROM `usuarios`
WHERE `correo` = 'mariagomez321@gmail.com'
 LIMIT 1